Revit 2027 API
MeshFromGeometryOperationResult.IsMeshAvailable Property
 Shows whether the result still contains the mesh which was constructed, if any, or whether it has been relinquished by 'getMesh'. The former is true, the later is false.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsMeshAvailable { get; }
Public ReadOnly Property IsMeshAvailable As Boolean
	Get
public:
property bool IsMeshAvailable {
	bool get ();
}
member IsMeshAvailable : bool with get
Property Value
Boolean
See Also
Reference
MeshFromGeometryOperationResult Class
Autodesk.Revit.DB Namespace